// Task 1

/*
let Name;
let Admin;
Name = 'Ruslan';
Admin = Name;
alert(Admin);
*/

/*********************************************************/

// Task 2

/*
const birthday = '18.04.1982 ' ;   // Можна використати великиі літери для імені константи, це не порушує правила задання імені змінної, крім того це хороша практика вікористовувати великі літери у імені константи
const age = someCode(birthday);    // Можна використати великиі літери для імені константи, це не порушує правила задання імені змінної, крім того це хороша практика вікористовувати великі літери у імені константи
*/

/*********************************************************/

// Task 3

/*
let Name = "Ilya " ;
alert ( ` hello ${ 1 } ` );      // hello 1      Окрім змінних можна інтерполювати числа і навіть математичні операції, які стають частиною рядка
alert ( ` hello ${ "Name " } `); // hello Name   Також можна інтерполювати рядоку у рядок
alert ( ` hello ${ Name } ` );   // hello Ilya   Змінна Name існує, тому її значення інтерполюється у рядок
*/

/*********************************************************/

// Task 4

/*
"" + 1 + 0      //  10        Перша дія рядок плюс число дасть рядок, друго дія рядок плюс число дасть рядок
"" - 1 + 0      //  -1        Пустий рядок неявно перетворюється в число 0, а далі виконуються звичайні арифметичні дії  
true + false    //   1        true неявно перетворюється на 1 а false на 0, а далі виконуються звичайні арифметичні дії 
6 / "3"         //   2        JS дуже розумний, тому відбувається неявне перетворення рядка "3" на число 3, а далі виконуються звичайні арифметичні дії 
"2" * "3"       //   6        JS дуже розумний, тому відбувається неявне перетворення рядків "2" та "3" на числа 2 та 3, а далі виконуються звичайні арифметичні дії
4 + 5 + "px"    // 9px        Перша дія сума двох чисел дорівнює число, друго дія число плюс рядок дорівнює рядок
"$" + 4 + 5     // $45        Перша дія рядок плюс число дасть рядок, друго дія рядок плюс число дасть рядок
"4" - 2         //   2        Оскільки віднімання числа від рядка неприпустимо, рядок "4" неявно перетворюється в число 4, а далі виконуються звичайні арифметичні дії
"4px" - 2       // NaN        Оскільки перший рядок перетворити в число неможливо, віднімання числа від такого рядка дасть NaN
7 / 0           // Infinity   Ділення будь-якого числа (окрім 0) на 0 дасть Infinity (або -Infinity, якщо перше число від'ємне)
" – 9 " + 5     // " - 9 5"   Рядок плюс число дасть рядок
" – 9 " - 5     // NaN        Оскільки у рядку присутні пробіли, перетворити цей рядок у число неможливо, віднімання числа від такого рядка дасть NaN
null + 1        //   1        Нічого плюс число дасть це число
undefined + 1   // NaN        При арифметичних операціях з числом undefined перетворюється в NaN, а NaN плюс число дасть NaN
*/

/*********************************************************/

// Task 5

/*
let a = 1, b = 1;
let c = ++a; // a збільшується на 1 і потім клонується в c, оскільки це префіксний інкремент, виходить a=2, c=2.
let d = b++; // b клонується в d і потім збільшується на 1, оскільки це постфіксний інкремент, виходить b=2, d=1
//Результат: a=2, b=2, c=2, d=1
*/

/*********************************************************/

// Task 6

/*
let a = 2;                
let x = 1 + (a *= 2 ); // Спочатку виконується дія a*2, потім привласнюється до a, в результаті чтого а=4, потім до а додається 1 і привласнюється до х, в результаті чтого х=5
//Результат: a=4, x=5
*/

/*********************************************************/

// Task 7

/*
5 > 4                   //true      Число 5 більше за число 4
"ананас" > "яблуко"     //false     У кирилиці літера "я" вважається юільшою за літеру "а"
"2" > "12"              //true      Перша цифра першого рядку більша за першу цифру другого рядка
undefined == null       //true      Фактично undefined та null мають однакове значення, вони дорівнюють один одному і більше нічому іншому
undefined === null      //false     Хоч undefined та null фактично мають однакове значення, але типи данних вони мають різні
null == "\n0\n"         //fasle     При такій суворій рівності null може дрівнювати лише undefined, і нічому іншому
null === +"\n0\n "      //fasle     Плюс перед рядком перетворює рядок в число, а саме в 0, бо це регулярний вираз, але null та число мають різні типи данниї
*/

/*********************************************************/

// Task 8

/*
let Name = prompt("Як вас звати?")
alert(Name)
*/

/*********************************************************/

// Task 9

/*
if ("0") {
    alert( ' Привіт');  // Так, виведеться, оскільки в умові присутній непустий рядок, а непустий рядок зводиться до булевого значення true
}
*/

/*********************************************************/

// Task 10

/*
let nameOfJavaScript = prompt("Яка «офіційна» назва JavaScript ?")

if (nameOfJavaScript == "ECMAScript"){
    alert("Правильно!")
} else {
    alert("Не знаєте? ECMAScript!")
}
*/

/*********************************************************/

// Task 11

/*
let number = Number(prompt("Введіть число"));

if (number>0){
    alert(1);
} else if (number<0){
    alert(-1);
} else if (number==0){
    alert(0);
} else {
    alert("Введено не число!")
}
*/

/*********************************************************/

// Task 12

/*
let result;
if(a + b < 4) {
result = ' Мало ';
} else {
result = 'Багато';
}

//Переписана версія:

let result = (a + b < 4) ? ' Мало ' : ' Багато ';

*/

/*********************************************************/

// Task 13

/*
let message;

if (login == ' Співробітник') {
message = ' Привіт ';
} else if (login == 'Директор') {
message = ' Добрий день! ';
} else if (login == '') {
message = 'Відсутній логін';
} else {
message = '';
}

//Переписана версія:


let message = (login==' Співробітник') ? ' Привіт ':
              (login == 'Директор') ? ' Добрий день! ':
              (login == '') ? 'Відсутній логін': '';
*/

/*********************************************************/

// Task 14

/*
alert( null || 2 || 1 ); // Код виведе 2, оскільки перший аргумент null у булевому типі дрівнює false, другий аргумент 2 є true, і він одразу виводиться а інші аргументи не перевіряються
*/

/*********************************************************/

// Task 15

/*
alert(alert (1) || 2 || alert(3)); // Виведе 1 потім 2. Спочатку відпрацьовує перший alert(1), виводить 1, але alert(1) - це функція, яка вертає undefined,
                                   // який у зовнішнього alert у булевому типі = false,
                                   // тому зовнішній alert переходить до наступного аргументу 2, це є true, тому останній внурішній alert не відпрацьовує
*/

/*********************************************************/

// Task 16

/*
alert(1 && null && 2); // виведе null, оскільки у даному виразі виводиться або перше хибне, якщо таке є, або останнє істинне, у даному виразі перше хибне це null
*/

/*********************************************************/

// Task 17

/*
alert(alert(1) && alert(2)); // Виведе 1 потім undefined. Спочатку відпрацює alert(1), але він, як функція, повертає undefined,
                             // оскільки undefined еквівалентно false, то до другого alert(2) не дійде, 
                             // бо у цьому логічному виразі виводить або перше хибне або останнє істинне
*/

/*********************************************************/

// Task 18

/*
alert(null || 2 && 3 || 4 );// Виведе 3. Першим відпрацьовує оператор &&, бо вищий по пріорітету, і він обирає останнє істинне, тобто 3,
                            // потім відпрацьовує перший оператор ||, і він обирає 3, томущо обирає перше істинне а інші аргументи не розглядаються
*/

/*********************************************************/

// Task 19

/*
let number = +prompt("Введіть число");
if (number>=14 && number<=90){
    alert("Число в діапазоні 14-90.")
} else {
    alert("Число не в діапазоні 14-90.")
}
*/

/*********************************************************/

// Task 20

/*
let number = +prompt("Введіть число");

//Варіант з НЕ

if (!(number>=14 && number<=90) ) {
    alert("Число не в діапазоні 14-90.")
} else {
    alert("Число в діапазоні 14-90.")
}

//Варіант без НЕ

if (number<14 || number>90)  {
    alert("Число не в діапазоні 14-90")
} else if (number>=14 && number<=90){
    alert("Число в діапазоні 14-90")
}
*/

/*********************************************************/

// Task 21

/*
if (-1 || 0) alert( 'first'); // Виведеться. В умові є хочаб одне логічне true - це (-1)
if (-1 && 0) alert( 'second' ); // Не виведется. Мають бути обидва логічні true, а тут лише (-1)
if (null || -1 && 1) alert('third' ); // Виведеться. Спочатку друга дія дає true, бо обидва аргумента true, потім перша дія дає true, бо хочаб один є true
*/

/*********************************************************/

// Task 22

/*
let login = prompt("Введіть логін");
if (login=="Адмін"){
    let password = prompt("Введіть пароль");
    if(password=="я головний"){
        alert("Здрастуйте!");
    } else {
        alert("Невірний пароль")
    }
} else if (login==null || login ==""){
    alert("Скасовно");
} else {alert("Я вас не знаю")}
*/

/*********************************************************/

// Task 23

/*
//Конструкція switch

switch (browser) {
    case 'Edge':
    alert(" You've got the Edge! ");
    break;
    case 'Chrome':
    case 'Firefox':
    
    case 'Safari':
    case 'Opera':
    alert( ' Okay we support these browsers too' );
    break;
    default:
    alert( ' We hope that this page looks ok!' );
    }

//Конструкція if...else

let browser;
if(browser=='Edge'){
    alert(" You've got the Edge! ")
} else if (browser=='Chrome' || browser=='Firefox' || browser=='Safari' || browser=='Opera'){
    alert(' Okay we support these browsers too')
} else {
    alert( ' We hope that this page looks ok!' );
}
*/

/*********************************************************/

// Task 24

/*
//Конструкція if...else

let a = +prompt( 'a?', '');
if(a == 0) {
alert(0);
}
if(a == 1) {
alert(1);
}
if(a == 2 || a == 3) {
alert('2,3');
}

//Конструкція switch

let a = +prompt( 'a?', '');
switch(a){
    case 0:
    alert(0);
    break;

    case 1:
    alert(1);
    break;

    case 2:
    case 3:
    alert('2,3')
    break;
}
*/

/*********************************************************/

// Task 25

/*
let number = +prompt("Введіть число");
if (number>0){
    alert(++number);
} else {
    alert(number);
}
*/

/*********************************************************/

// Task 26

/*
let number = +prompt("Введіть число");
if (number>0){
    alert(++number);
} else {
    alert(number-=2);
}
*/

/*********************************************************/

// Task 27

/*
let number = +prompt("Введіть число");
if (number>0){
    alert(++number);
} else if (number<0){
    alert(number-=2);
} else {
    number=10;
    alert(number);
}
*/

/*********************************************************/

// Task 28

/*
let num1 = +prompt("Перше число:");
let num2 = +prompt("Друге число:");
let num3 = +prompt("Третє число:");
let positive_count;
if (num1>0 && num2<=0 && num3<=0 || num2>0 && num1<=0 && num3<=0 || num3>0 && num2<=0 && num1<=0){
    positive_count=`Кількість позитивних: ${1}`;
    alert(positive_count);
} else if(num1>0 && num2>0 && num3<=0 || num1>0 && num3>0 && num2<=0 || num2>0 && num3>0 && num1<=0){
    positive_count=`Кількість позитивних: ${2}`;
    alert(positive_count);
} else if (num1>0 && num2>0 && num3>0){
    positive_count=`Кількість позитивних: ${3}`;
    alert(positive_count);
} else {
    positive_count=`Кількість позитивних: ${0}`;
    alert(positive_count);
}
*/

/*********************************************************/

// Task 29

/*
let num1 = +prompt("Перше число:");
let num2 = +prompt("Друге число:");
let num3 = +prompt("Третє число:");
let positive_count;
let negative_count;
if (num1>0 && num2<0 && num3<0 || num2>0 && num1<0 && num3<0 || num3>0 && num2<0 && num1<0){
    positive_count=`Кількість позитивних: ${1}`;
    negative_count=`Кількість негативних: ${2}`;
    alert(positive_count + '\n' + negative_count);
} else if(num1>0 && num2>0 && num3<0 || num1>0 && num3>0 && num2<0 || num2>0 && num3>0 && num1<0){
    positive_count=`Кількість позитивних: ${2}`;
    negative_count=`Кількість негативних: ${1}`;
    alert(positive_count + '\n' + negative_count);
} else if (num1>0 && num2>0 && num3>0){
    positive_count=`Кількість позитивних: ${3}`;
    negative_count=`Кількість негативних: ${0}`;
    alert(positive_count + '\n' + negative_count);
} else if (num1<0 && num2<0 && num3<0){
    positive_count=`Кількість позитивних: ${0}`;
    negative_count=`Кількість негативних: ${3}`;
    alert(positive_count + '\n' + negative_count);
} else if (num1==0 && num2==0 && num3==0){
    positive_count=`Кількість позитивних: ${0}`;
    negative_count=`Кількість негативних: ${0}`;
    alert(positive_count + '\n' + negative_count);
} else if (num1==0 && num2>0 && num3>0 || num2==0 && num1>0 && num3>0 || num3==0 && num1>0 && num2>0){
    positive_count=`Кількість позитивних: ${2}`;
    negative_count=`Кількість негативних: ${0}`;
    alert(positive_count + '\n' + negative_count);
} else if (num1==0 && num2<0 && num3<0 || num2==0 && num1<0 && num3<0 || num3==0 && num1<0 && num2<0){
    positive_count=`Кількість позитивних: ${0}`;
    negative_count=`Кількість негативних: ${2}`;
    alert(positive_count + '\n' + negative_count);
} else if (num1==0 && num2>0 && num3<0 || num1==0 && num3>0 && num2<0 ||
           num2==0 && num1>0 && num3<0 || num2==0 && num3>0 && num1<0 ||
           num3==0 && num1>0 && num2<0 || num3==0 && num2>0 && num1<0){
    positive_count=`Кількість позитивних: ${1}`;
    negative_count=`Кількість негативних: ${1}`;
    alert(positive_count + '\n' + negative_count);
} else if (num1>0 && num2==0 && num3==0 || num2>0 && num1==0 && num3==0 || num3>0 && num1==0 && num2==0){
    positive_count=`Кількість позитивних: ${1}`;
    negative_count=`Кількість негативних: ${0}`;
    alert(positive_count + '\n' + negative_count); 
} else if (num1<0 && num2==0 && num3==0 || num2<0 && num1==0 && num3==0 || num3<0 && num1==0 && num2==0){
    positive_count=`Кількість позитивних: ${0}`;
    negative_count=`Кількість негативних: ${1}`;
    alert(positive_count + '\n' + negative_count);
}
*/

/**************************************************************/

//Task 30

/*
let num1 =+prompt("Перше число:");
let num2 =+prompt("Друге число:");
if (num1>num2) {
    alert(num1)
} else if (num1<num2){
    alert(num2)
} else {
    alert("Числа рівні");
}
*/

/***************************************************************/

//Task 31

/*
let num1 =+prompt("Перше число:");
let num2 =+prompt("Друге число:");
if (num1<num2) {
    alert(num1)
} else if (num1>num2){
    alert(num2)
} else {
    alert("Числа рівні");
}
*/

/***************************************************************/

//Task 32

/*
let num1 =+prompt("Перше число:");
let num2 =+prompt("Друге число:");
if (num1>num2) {
    alert(num1);
    alert(num2);
} else if (num1<num2){
    alert(num2);
    alert(num1)
} else {
    alert("Числа рівні");
}
*/

/***************************************************************/

//Task 33

/*
let num_A = +prompt("Значення A:");
let num_B = +prompt("Значення B:");
let temp;
if (num_A<num_B){
    alert(`Значення змінної num_A: ${num_A}` + "\n" + `Значення змінної num_B: ${num_B}`);
} else if (num_A>num_B){
    temp = num_A;
    num_A = num_B;
    num_B = temp;
    alert(`Значення змінної num_A: ${num_A}` + "\n" + `Значення змінної num_B: ${num_B}`);
} else {
    alert("Змінні рівні")
}
*/

/***************************************************************/

//Task 34

/*
let num_A = +prompt("Значення A:");
let num_B = +prompt("Значення B:");
let sum = num_A + num_B;

if (num_A!=num_B){
    num_A = num_B = sum;
    alert(`Значення змінної num_A: ${num_A}` + "\n" + `Значення змінної num_B: ${num_B}`);
} else {
    num_A = num_B = 0;
    alert(`Значення змінної num_A: ${num_A}` + "\n" + `Значення змінної num_B: ${num_B}`);
}
*/

/***************************************************************/

//Task 35

/*
let num_A = +prompt("Значення A:");
let num_B = +prompt("Значення B:");
if (num_A>num_B){
    num_B = num_A;
    alert(`Значення змінної num_A: ${num_A}` + "\n" + `Значення змінної num_B: ${num_B}`);
} else if (num_A<num_B){
     num_A = num_B;
     alert(`Значення змінної num_A: ${num_A}` + "\n" + `Значення змінної num_B: ${num_B}`);   
} else {
    num_B = num_A = 0;
    alert(`Значення змінної num_A: ${num_A}` + "\n" + `Значення змінної num_B: ${num_B}`);
}
*/

/***************************************************************/

//Task 36

/*
let num1 = +prompt("Перше число:");
let num2 = +prompt("Друге число:");
let num3 = +prompt("Третє число:");
if (num1<num2 && num1<num3){
    alert(`Найменше число: ${num1}`);
} else if (num2<num1 && num2<num3){
    alert(`Найменше число: ${num2}`);
} else if (num3<num1 && num3<num2){
    alert(`Найменше число: ${num3}`);
} else {
    alert("Всі числа рівні");
}
*/

/***************************************************************/

//Task 37

/*
let num1 = +prompt("Перше число:");
let num2 = +prompt("Друге число:");
let num3 = +prompt("Третє число:");
if (num1>num2 && num1<3 || num1<num2 && num1>num3){
    alert(`Середнє з чисел: ${num1}`);
} else if (num2>num1 && num2<num3 || num2<num1 && num2>num3){
    alert(`Середнє з чисел: ${num2}`);
} else if (num3>num2 && num3<num1 || num3<num2 && num3>num1){
    alert(`Середнє з чисел: ${num3}`);
} else {
    alert("Всі числа або рівні, або присутні два рівних числа");
}
*/

/***************************************************************/

//Task 38

/*
let num1 = +prompt("Перше число:");
let num2 = +prompt("Друге число:");
let num3 = +prompt("Третє число:");

if (num1>num2 && num1>num3 && num2<num3){
    alert(`Найменше число: ${num2}`);
    alert(`Найбільше число: ${num1}`);
} else if (num1>num2 && num1>num3 && num3<num2){
    alert(`Найменше число: ${num3}`);
    alert(`Найбільше число: ${num1}`);
} else if (num2>num1 && num2>num3 && num1<num3){
    alert(`Найменше число: ${num1}`);
    alert(`Найбільше число: ${num2}`);
} else if (num2>num1 && num2>num3 && num3<num1){
    alert(`Найменше число: ${num3}`);
    alert(`Найбільше число: ${num2}`);
} else if (num3>num1 && num3>num2 && num1<num2){
    alert(`Найменше число: ${num1}`);
    alert(`Найбільше число: ${num3}`);
} else if (num3>num1 && num3>num2 && num2<num1){
    alert(`Найменше число: ${num2}`);
    alert(`Найбільше число: ${num3}`);
} else {
    alert("Всі числа або рівні, або присутні два рівних числа");
}
*/

/***************************************************************/

//Task 39

/*
let num1 = +prompt("Перше число:");
let num2 = +prompt("Друге число:");
let num3 = +prompt("Третє число:");

if (num1>num3 && num2>num3){
    alert(`Сума двох найбільших: ${num1+num2}`);
} else if (num1>num2 && num3>num2){
    alert(`Сума двох найбільших: ${num1+num3}`);
} else if (num2>num1 && num3>num1){
    alert(`Сума двох найбільших: ${num2+num3}`);
} else {
    alert("Всі числа або рівні, або присутні два рівних найменших числа числа");
}
*/

/***************************************************************/

//Task 40

/*
let num1 = +prompt("Перше число:");
let num2 = +prompt("Друге число:");
let num3 = +prompt("Третє число:");

if (num2==num3 && num1!=num2 && num1!=num3){
    alert(`Відмінне від інших число: ${num1}`);
} else if (num2==num1 && num3!=num2 && num3!=num1){
    alert(`Відмінне від інших число: ${num3}`);
} else if (num3==num1 && num2!=num1 && num2!=num3){
    alert(`Відмінне від інших число: ${num2}`);
} else {
    alert("Всі числа або різні, або однакові");
}
*/



