//Task 1

/*
let i = 3;    //Останнє значення буде 1. Це тому, що декремент є постфіксний. 
while (i) {   //На початку значення 3 передається в умову, задовольнє, виводить, потім декрементує.
alert(i--);   //Потім значення 2 передається в умову, задовольняє, виводить, декрементує.
}             //Потім значення 1 передається в умову, задовольняє, виводить, декрементує.
*/            //Потім значення 0 передається в умову, не задовольняє, тому далі умова не виконується.

/******************************************************************/

//Task 2

/*
let A = +prompt("Число А:");
let B = +prompt("Число B:");
let C = +prompt("Число C:");

if (A<B && B<C){
    A *= 2; 
    B *= 2;
    C *= 2;
    alert(`Нові значення: A=${A}, B=${B}, C=${C}`);
} else {
    A=-A;
    B=-B;
    C=-C;
    alert(`Нові значення: A=${A}, B=${B}, C=${C}`);
}
*/

/******************************************************************/

//Task 3

/*
let A = +prompt("Число А:");
let B = +prompt("Число B:");
let C = +prompt("Число C:");

if (A<B && B<C || A>B && B>C){
    A *= 2; 
    B *= 2;
    C *= 2;
    alert(`Нові значення: A=${A}, B=${B}, C=${C}`);
} else {
    A=-A;
    B=-B;
    C=-C;
    alert(`Нові значення: A=${A}, B=${B}, C=${C}`);
}
*/

/******************************************************************/

//Task 4

/*
let point_A = +prompt("Положення точки A:");
let point_B = +prompt("Положення точки B:");
let point_C = +prompt("Положення точки C:");

let length_A_B = Math.abs(point_B - point_A); // Відстань між B та A
let length_A_C = Math.abs(point_C - point_A); // Відстань між С та А

if (length_A_B<length_A_C){
    alert(`Ближча точка B.\nВідстань між A та B: ${length_A_B}`)
} else if (length_A_B>length_A_C){
    alert(`Ближча точка C.\nВідстань між A та C: ${length_A_C}`)
} else {
    alert("Відстань однакова");
}
*/

/******************************************************************/

//Task 5

/*
let O_x = prompt("Координата X точки O:");
let O_y = prompt("Координата Y точки O:");

if (+O_x==0 && +O_y==0){
    alert(0);
} else if (+O_x!==0 && +O_y==0){
    alert(1);
} else if (+O_x==0 && +O_y!=0){
    alert(2);
} else if (isNaN(+O_x) || isNaN(+O_y)){
    alert("Координати не введено.")
} else alert(3);
*/

/******************************************************************/

//Task 6

/*
let O_x = +prompt("Координата X точки O:");
let O_y = +prompt("Координата Y точки O:");

if (O_x>0 && O_y>0){
    alert("(I)-чверть.");
} else if (O_x<0 && O_y>0){
    alert("(II)-чверть.");
} else if (O_x<0 && O_y<0){
    alert("(III)-чверть.");
} else if (O_x>0 && O_y<0){
    alert("(IV)-чверть.");
} else alert("Точка у центрі координат або точка не визначена.")
*/

/******************************************************************/

//Task 7

/*
// Варіант завдання 1
let point_Ax = +prompt("Введіть координату A(x)");
let point_Ay = +prompt("Введіть координату A(y)");
let point_Bx = +prompt("Введіть координату B(x)");
let point_By = +prompt("Введіть координату B(y)");
let point_Cx = +prompt("Введіть координату C(x)");
let point_Cy = +prompt("Введіть координату C(y)");
let point_Dx = point_Cx;
let point_Dy = point_Ay;
alert(`Координати вершини D: (${point_Dx};${point_Dy})`)

// Варіант завдання 2
let A = prompt("Введіть координати вершини A через кому у форматі: x,y");
let B = prompt("Введіть координати вершини B через кому у форматі: x,y");
let C = prompt("Введіть координати вершини C через кому у форматі: x,y");
let arr_A = A.split(','); // Перетворюємо рядок в масив з координатами у виді [x,y]
let arr_B = B.split(','); // Перетворюємо рядок в масив з координатами у виді [x,y]
let arr_C = C.split(','); // Перетворюємо рядок в масив з координатами у виді [x,y]
let D = `${arr_C[0]},${arr_A[1]}`;
alert(`Координати вершини D:  ${D}`)
*/

/******************************************************************/

//Task 8

/*
let year_num = +prompt("Введіть номер року");
if (year_num!=0 && year_num % 4==0 && year_num % 100!=0 || year_num!=0 && year_num % 400==0){
    alert("Високосний рік. 366 днів.");
} else if (isNaN(year_num) || year_num==0) {
    alert("Рік не введено.")
} else alert("Звичайний рік. 365 днів.")
*/

/******************************************************************/

//Task 9

/*
let my_num = +prompt("Введіть число");
if (my_num >0 && my_num % 2==0){
    alert("Позитивне парне число.")
} else if (my_num>0 && my_num % 2 !=0){
    alert("Позитивне непарне число.")
} else if (my_num <0 && my_num % 2==0){
    alert("Негативне парне число.")
} else if (my_num<0 && my_num % 2 !=0){
    alert("Негативне непарне число")
} else alert("Нульове число");
*/

/******************************************************************/

//Task 10

/*
let my_num = prompt("Введіть ціле число від 1 до 999");
if (my_num.length==1 && +my_num % 2 == 0 && my_num>=1 && my_num<=999){
    alert("Парне однозначне число.");
} else if (my_num.length==1 && +my_num % 2 != 0 && my_num>=1 && my_num<=999){
    alert("Непарне однозначне число.");
} else if (my_num.length==2 && +my_num % 2 == 0 && my_num>=1 && my_num<=999){
    alert("Парне двохзначне число.");
} else if (my_num.length==2 && +my_num % 2 != 0 && my_num>=1 && my_num<=999){
    alert("Непарне двохзначне число.");
} else if (my_num.length==3 && +my_num % 2 == 0 && my_num>=1 && my_num<=999){
    alert("Парне тризначне число.");
} else if (my_num.length==3 && +my_num % 2 != 0 && my_num>=1 && my_num<=999){
    alert("Непарне тризначне число.");
} else alert("Число не в діапазоні від 1 до 999");
*/

/******************************************************************/

//Task 11

/*
//Префіксний варіант ++i:

let i = 0;
while (++i < 5) alert(i); // 1,2,3,4. Оскільки це префіксний інкремент, спочатку додає 1, потім перевіряє чи задовольняє умові, потім виводить.

//Постфіксний варіант i++:

let i = 0;
while (i++ < 5) alert(i); // 1,2,3,4,5. Оскільки це постфіксний інкремент, то він спочатку перевіряє істинність умови, потім додає 1, а потім виводить.
*/

/******************************************************************/

//Task 12

//Постфіксна форма :
/*
for (let i = 0; i < 5; i++) alert(i);

//Префіксна форма :
for (let i = 0; i < 5; ++i) alert(i);

*/
// Виведе 0,1,2,3,4 в обох випадках. Для циклу for є чітка послідовність дій.
// У першій ітерації перша дія - присвоєння, друга - перевірка істинності, третя - тіло циклу, і вже четверта - крок.
// Для інших ітерацій вже перша дія - перевірка істинності, друга - тіло циклу, і третя - крок.

/******************************************************************/

//Task 13

/*
for (let i = 2; i<=10; i++){
    if (i % 2 !=0) continue; //Якщо число непарне, пропустити ітерацію і перейти до наступної.
    alert(i);
}
*/

/******************************************************************/

//Task 14

/*
//Цикл for:

for (let i = 0; i < 3; i++) {
    alert( `number ${i}!` );
}

//Цикл while:

let i = 0;
while (i<3){
    alert( `number ${i}!`);
    i++;
}
*/

/******************************************************************/

//Task 15

/*
let my_num = prompt("Введіть число більше за 100");
while ( +my_num<=100 && my_num!=null ) {my_num = prompt("Введіть число більше за 100");}
*/

/******************************************************************/

//Task 16

/*
let n = +prompt("Введіть число");
Loop1:for (let i = 2; i<=n; i++){

    for(let j = 2; j<i; j++){
        if (i % j == 0) continue Loop1; // Використання назви лейблу переходить да наступного кроку саме у зовнішньому циклі.
    }
    alert(i);
}
*/

/******************************************************************/

//Task 17

/*
let num1 = +prompt('Перше число:');
let num2 = +prompt('Друге число:');
alert(`Середнє арифметичне двох чисел: ${(num1+num2)/2}`)
*/

/******************************************************************/

//Task 18

/*
let my_num = +prompt('Введіть число');
alert(`Квадрат числа: ${my_num**2}`);
*/

/******************************************************************/

//Task 19
    
/*
let num1 = +prompt('Перше число:');
let num2 = +prompt('Друге число:');
let num3 = +prompt('Третє число:');
alert(`Різниця між більшим та меншим числами: ${Math.max(num1,num2,num3)-Math.min(num1,num2,num3)}`);
*/

/******************************************************************/

//Task 20

/*
let my_num = +prompt('Введіть число');
if (my_num % 2 ==0){
    alert('Число парне');
} else if (my_num % 2 !=0 ){
    alert('Число непарне');
}
*/

/******************************************************************/

//Task 21

/*
let my_num = prompt("Введіть натуральне число менше за 100");
if (my_num.length==1 && +my_num>0 && +my_num<100){
    alert(`Кількість цифр числа: 1\nСума цифр: ${my_num}`);
} else if (my_num.length==2 && +my_num>0 && +my_num<100){
    alert(`Кількість цифр числа: 2\nСума цифр: ${+my_num[0] + (+my_num[1])}`);
} else alert('Число не в діапазоні від 1 до 99');
*/

/******************************************************************/

//Task 22

/*
let my_value = prompt("Введіть значення з приставкою cm або inch, конвертер конвертує у протилежне");
if (my_value[my_value.length-1]=='m'){
    alert((parseFloat(my_value)/2.54).toFixed(2) + "inch");
} else if (my_value[my_value.length-1]=='h'){
    alert((parseFloat(my_value)*2.54).toFixed(2) + "cm");
} else alert("Невірний формат");
*/

/******************************************************************/

//Task 23

/*
alert('Вітаємо у грі "Хто хоче стати міліонером?". Гра починається.')
let question = prompt("Питання № 1. Яка сухопутна тварина найбільша в світі?\na. Слон\nb. Тигр\nc. Жираф\nd. Дельфін");
let cash = 0;

if (question=='a'){
    cash+=500;
    alert(`Це правильна відповід. Ваш виграш: ${cash}$`);
    question = prompt("Питання № 2. Яка річка найдовша в світі?\na. Амазонка\nb. Дніпро\nc. Ніл\nd. Янцзи");

    if (question=='c') {
        cash+=500;
        alert(`Це правильна відповід. Ваш виграш: ${cash}$`);
        question = prompt("Питання № 3. Хто зображений на 100$-купюрі?\na. Джордж Вашингтон\nb. Бенджамін Франклін\nc. Авраам Лінкольн\nd. Джон Кеннеді");

        if (question=='b'){
            cash+=500;
            alert(`Це правильна відповід. Ваш виграш: ${cash}$`);
            question = prompt("Питання № 4. Хто з князіа охрестив Київську Русь?\na. Князь Олег\nb. Ярослав Мудрий\nc. Володимир Великий\nd. Князь Святослав");

            if (question=='c'){
                cash+=500;
                alert(`Це правильна відповід. Ваш виграш: ${cash}$`);
                question = prompt("Питання № 5. Ким була написана поема Катерина?\na. Тарас Шевченко\nb. Іван Франко\nc. Леся Українка\nd. Григорій Квітка-Основ'яненко");

                if (question=='a'){
                    cash+=1000;
                    alert(`Вітаємо, ви стали переможцем гри. Ваш виграш: ${cash}$`);
                } else alert("Нажаль, ви програли. Не засмучуйтесь, наступного разу пощастить!");
            }
        } else alert("Нажаль, ви програли. Не засмучуйтесь, наступного разу пощастить!");

    } else alert("Нажаль, ви програли. Не засмучуйтесь, наступного разу пощастить!");

} else alert("Нажаль, ви програли. Не засмучуйтесь, наступного разу пощастить!");
*/

/******************************************************************/

//Task 24

/*
let my_num = prompt('Введіть трьохзначне число');
if (my_num.length==3 && +my_num%2==0){
    alert(`Число парне.\nСума цифр: ${+my_num[0]+(+my_num[1])+(+my_num[2])}`);
} else if (my_num.length==3 && +my_num%2!=0){
    alert(`Число непарне.\nДобуток цифр: ${+my_num[0]*(+my_num[1])*(+my_num[2])}`);
} else alert('Тризначне число не введено.')
*/

/******************************************************************/

//Task 25

/*
let side_a = +prompt('Довжина сторони a:');
let side_b = +prompt('Довжина сторони b:');
let side_c = +prompt('Довжина сторони c:');

if (side_a + side_b > side_c && side_a + side_c > side_b && side_b + side_c > side_a){
    alert("Трикутник існує.")
} else alert('Трикутник не існує')
*/

/******************************************************************/

//Task 26

/*
let Ax = 4; // Можна змінити
let Ay = 9; // Можна змінити
let R = 10; // Можна змінити
// Якщо поглянути на координатну площину, то проекції точки на осі X та Y є катетами прямокутного прямокутника,
// а гіпотенуза як раз є відстаннь між початком координат та точкою.
let hypotenuse = Math.sqrt(Ax**2 + Ay**2);
if (hypotenuse<R){
    alert("Точка лежить в середині кола.");
} else if (hypotenuse>R){
    alert("Точка лежить за межами кола.");
} else alert("Точка лежить на колі.")
*/

/******************************************************************/

//Task 27

/*
let user = {};
user.name = 'John';
user.surname = 'Smith';
user.name = 'Pete';
delete user.name;
*/

/******************************************************************/

//Task 28

/*
const user = {
    name: "John"
};
user.name = "Pete"; // Це працюватиме. Не працюватиме тоді, коли змінюється посилання на об'єкт,
                    // а зміна властивостей об'єкта, об'явленого через константу допускається.
*/

/******************************************************************/

//Task 29

/*
let salaries = {
    John: 100,
    Ann: 160,
    Pete: 130
}
let sum = 0;
for (key in salaries){
    sum+=salaries[key];
}
alert(sum);
*/

/******************************************************************/

//Task 30

/*
let myObject = {
    workExperiance:6,
    name:'Ruslan',
    surname:'Hasanov',
    age:25,
    salary:700
}

function multiplyNumeric(obj){
   for (key in obj){
        if (typeof(obj[key])!='number') continue;
        obj[key]*=2; 
        
    }
}

multiplyNumeric(myObject);
console.log(myObject);
*/
